Revit 2027 API
ParameterTypeId.StairsSupportUpperEndCut Property
 "Upper End Cut": Upper End Cut
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsSupportUpperEndCut { get; }
Public Shared ReadOnly Property StairsSupportUpperEndCut As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsSupportUpperEndCut {
	ForgeTypeId^ get ();
}
static member StairsSupportUpperEndCut : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace